---
kind: type
id: T:Autodesk.Revit.DB.FamilyParameterSet
source: html/f2ee1ee9-0605-9353-b83b-57db865119fc.htm
---
# Autodesk.Revit.DB.FamilyParameterSet

A set that contains FamilyParameter objects.

## Syntax (C#)
```csharp
public class FamilyParameterSet : APIObject,
	IEnumerable
```